-- ----------------------------
-- Table structure for 用户
-- ----------------------------
CREATE TABLE '用户'  (
  '用户ID' varchar(20) PRIMARY KEY,
  '车票ID' Varchar(20) NOT NULL,
  '姓名' Varchar(20) NOT NULL,
  '身份证号' Varchar(20) NOT NULL,
  '购票时间' datetime NOT NULL,
  FOREIGN KEY (车票ID) REFERENCES 车票信息表(车票ID)
)
INSERT INTO '用户' VALUES ('1', '1', '嘿嘿嘿', '452226200001011234');
INSERT INTO '用户' VALUES ('2', '1', '呵呵呵', '452226200001011230');
INSERT INTO '用户' VALUES ('3', '1', '鹅鹅鹅', '452226200001011231');
INSERT INTO '用户' VALUES ('4', '1', '嘎嘎嘎', '452226200001011232');
INSERT INTO '用户' VALUES ('6', '1', '王德法', '452226200001011235');
INSERT INTO '用户' VALUES ('7', '2', '奥里给', '452226200001011236');
INSERT INTO '用户' VALUES ('8', '1', '雷霆嘎巴', '452226200001011237');
INSERT INTO '用户' VALUES ('9', '1', '哈拉少', '452226200001011238');
INSERT INTO '用户' VALUES ('10', '1', '小鸟伏特加', '452226200001011239');
INSERT INTO '用户' VALUES ('11', '1', '嗷嗷嗷', '452226200001011240');
INSERT INTO '用户' VALUES ('12', '1', '疾风剑豪', '452226200001011241');
INSERT INTO '用户' VALUES ('13', '1', '八嘎', '452226200001011242');
INSERT INTO '用户' VALUES ('14', '1', '69岁老同志', '452226200001011243');
INSERT INTO '用户' VALUES ('15', '1', '马保国', '452226200001011244');
INSERT INTO '用户' VALUES ('16', '1', '松果', '452226200001011245');
INSERT INTO '用户' VALUES ('17', '1', '糖豆', '45222000100010001');
INSERT INTO '用户' VALUES ('20', '1', '闪电鞭', '45222000100010002');
INSERT INTO '用户' VALUES ('21', '1', '三维', '45222000100010003');
INSERT INTO '用户' VALUES ('22', '1', '立体', '45222000100010004');
INSERT INTO '用户' VALUES ('23', '19', '混元劲', '452226000000000001');
INSERT INTO '用户' VALUES ('29', '2', '耗子尾汁', '452226000100020003');
INSERT INTO '用户' VALUES ('30', '20', '婷婷', '452226000100020005');

-- ----------------------------
-- Table structure for 管理员
-- ----------------------------
CREATE TABLE '管理员' (
  'id' int(10) PRIMARY KEY,
  '用户名' varchar(50) NOT NULL,
  '密码' varchar(10) NOT NULL,
);

INSERT INTO '管理员' VALUES ('1', 'admin0', '123456');
INSERT INTO '管理员' VALUES ('2', 'admin1', '123456');
INSERT INTO '管理员' VALUES ('3', 'admin2', '123456');
INSERT INTO '管理员' VALUES ('4', 'admin3', '123456');
INSERT INTO '管理员' VALUES ('5', 'admin4', '123456');
INSERT INTO '管理员' VALUES ('6', 'admin5', '123456');
INSERT INTO '管理员' VALUES ('7', 'admin6', '123456');
INSERT INTO '管理员' VALUES ('8', 'admin7', '123456');
INSERT INTO '管理员' VALUES ('9', 'admin8', '123456');
INSERT INTO '管理员' VALUES ('10', 'admin9', '123456');
INSERT INTO '管理员' VALUES ('20', 'admin1', '123456');

-- ----------------------------
-- Table structure for 汽车信息
-- ----------------------------
DROP TABLE IF EXISTS '汽车信息';
CREATE TABLE '汽车信息' (
  '汽车ID' varchar(20) PRIMARY KEY,
  '汽车型号' varchar(20) NOT NULL,
  '最大载客量' int NOT NULL,
  '车牌号' varchar(20),
  
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8mb4;

INSERT INTO '汽车信息' VALUES ('202101', '五菱之光', '22', '豫A-0000');
INSERT INTO '汽车信息' VALUES ('202102', '五菱神光', '20', '豫A-0001');
INSERT INTO '汽车信息' VALUES ('202103', '五菱荣光', '30', '豫A-0002');
INSERT INTO '汽车信息' VALUES ('202104', '五菱发光', '50', '豫A-0003');
INSERT INTO '汽车信息' VALUES ('202105', '五菱发热', '50', '豫A-0004');
INSERT INTO '汽车信息' VALUES ('202106', '五菱魔光', '50', '豫A-0005');
INSERT INTO '汽车信息' VALUES ('202107', '大黄蜂', '35', '豫A-0006');
INSERT INTO '汽车信息' VALUES ('202108', '擎天柱', '30', '豫A-0007');
INSERT INTO '汽车信息' VALUES ('202109', '奥迪A8', '5', '豫A-0008');
INSERT INTO '汽车信息' VALUES ('202110', '五菱神车', '51', '豫A-0010');
INSERT INTO '汽车信息' VALUES ('202111', '五菱魔改', '60', '豫A-0011');
INSERT INTO '汽车信息' VALUES ('202112', '擎天柱', '18', '豫A-0012');
INSERT INTO '汽车信息' VALUES ('202113', '威震天', '25', '豫A-0013');
INSERT INTO '汽车信息' VALUES ('202114', '乘风大运', '50', '豫A-0014');
INSERT INTO '汽车信息' VALUES ('202115', '布加迪威龙', '50', '豫A-0015');
INSERT INTO '汽车信息' VALUES ('202116', '奔驰客运', '50', '豫A-0016');
INSERT INTO '汽车信息' VALUES ('202117', '五菱发光', '50', '豫A-0017');
INSERT INTO '汽车信息' VALUES ('202118', '大黄蜂', '35', '豫A-0018');
INSERT INTO '汽车信息' VALUES ('202119', '红蜘蛛', '30', '豫A-0019');
INSERT INTO '汽车信息' VALUES ('202120', '擎天柱', '50', '豫A-0020');
INSERT INTO '汽车信息' VALUES ('202121', '奔驰客运', '50', '豫A-0021');
INSERT INTO '汽车信息' VALUES ('202122', '迈巴赫', '50', '豫A-0022');
INSERT INTO '汽车信息' VALUES ('202123', '宝骏630', '5', '豫A-0023');
INSERT INTO '汽车信息' VALUES ('202124', '霸龙重卡', '50', '豫A-0024');
INSERT INTO '汽车信息' VALUES ('202125', '大黄蜂', '35', '豫A-0025');
INSERT INTO '汽车信息' VALUES ('202126', '五菱魔改', '60', '豫A-0026');
INSERT INTO '汽车信息' VALUES ('202127', '霸天虎', '18', '豫A-0027');
INSERT INTO '汽车信息' VALUES ('202128', '乘风大运', '50', '豫A-0028');
INSERT INTO '汽车信息' VALUES ('202129', '霸天虎', '18', '豫A-0029');
INSERT INTO '汽车信息' VALUES ('202130', '威震天', '25', '豫A-0030');
INSERT INTO '汽车信息' VALUES ('202135', '阿斯顿马丁', '21', '桂B-0001');
INSERT INTO '汽车信息' VALUES ('202136', '塞恩', '52', '桂B-0002');

-- ----------------------------
-- Table structure for 车票信息表
-- ----------------------------
DROP TABLE IF EXISTS '车票信息表';
CREATE TABLE '车票信息表' (
  '车票ID' varchar(20) PRIMARY KEY,
  '汽车ID' varchar(20) NOT NULL,
  '总票数' int NOT NULL,
  '票价' int NOT NULL,
  '已售' int NOT NULL,
  '未售' int NOT NULL,
  FOREIGN KEY(汽车ID) REFERENCES 汽车信息(汽车ID)
);

-- ----------------------------
-- Records of 车票信息表
-- ----------------------------
INSERT INTO '车票信息表' VALUES ('194901', '202101', '45', '2021-01-06 00:00:00','30','郑州轻工业大学','郑州大学','1','12','33');
INSERT INTO '车票信息表' VALUES ('194902', '202102', '15', '2021-01-04 08:10:00','10','郑州大学','火车站','3','12','3');
INSERT INTO '车票信息表' VALUES ('194903', '202103', '25', '2021-01-04 08:05:00','15','河南工业大学','二七广场','3','22','3');
INSERT INTO '车票信息表' VALUES ('194904', '202104', '45', '2021-01-04 08:15:00','20','科学大道136号','郑州轻工业大学','1','30','15');
INSERT INTO '车票信息表' VALUES ('194905', '202105', '45', '2021-01-04 08:20:00','40','郑州大学','郑州轻工业大学','5','32','13');
INSERT INTO '车票信息表' VALUES ('194906', '202106', '45', '2021-01-04 08:30:00','10','须水河','二七广场','2','40','5');
INSERT INTO '车票信息表' VALUES ('194907', '202107', '35', '2021-01-01 08:25:00','20','二七广场','河南大学','1','20','15');
INSERT INTO '车票信息表' VALUES ('194908', '202108', '20', '2021-01-04 08:35:00','30','河南工业大学','火车站','1','15','5');
INSERT INTO '车票信息表' VALUES ('194909', '202109', '45', '2021-01-04 09:00:00','50','河南大学','二七广场','5','12','33');
INSERT INTO '车票信息表' VALUES ('194910', '202110', '35', '2021-01-04 09:10:00','60','郑州轻工业大学','火车站','1','12','23');
INSERT INTO '车票信息表' VALUES ('194911', '202111', '35', '2021-01-04 07:30:00','40','二七广场','河南大学','8','22','13');
INSERT INTO '车票信息表' VALUES ('194912', '202112', '15', '2021-01-04 09:30:00','30','科学大道136号','二七广场','1','15','0');
INSERT INTO '车票信息表' VALUES ('194913', '202113', '25', '2021-01-04 09:20:00','20','二七广场','河南大学','1','20','5');
INSERT INTO '车票信息表' VALUES ('194914', '202114', '45', '2021-01-04 09:10:00','30','郑州轻工业大学','河南大学','1','17','28');
INSERT INTO '车票信息表' VALUES ('194915', '202115', '45', '2021-01-04 09:50:00','40','河南大学','郑州大学','5','26','19');
INSERT INTO '车票信息表' VALUES ('194916', '202116', '48', '2021-01-04 09:01:00','50','郑州大学','郑州大学','4','12','36');
INSERT INTO '车票信息表' VALUES ('194917', '202102', '45', '2021-01-06 00:00:00','30','河南工业大学','河南大学','1','12','33');
INSERT INTO '车票信息表' VALUES ('194918', '202102', '45', '2021-01-06 00:00:00','30','河南大学','郑州大学','4','12','33');
INSERT INTO '车票信息表' VALUES ('194919', '202101', '20', '2021-01-06 00:00:00','20','火车站','郑州轻工业大学','1','12','8');
INSERT INTO '车票信息表' VALUES ('194920', '202101', '20', '2021-01-06 00:00:00','20','河南大学','二七广场','2','20','00');
INSERT INTO '车票信息表' VALUES ('194921', '202105', '50', '2021-01-07 00:00:00','30','科学大道136号','郑州大学','1','12','38');
INSERT INTO '车票信息表' VALUES ('194922', '202105', '50', '2021-01-07 00:00:00','60','河南大学','二七广场','2','33','17');
INSERT INTO '车票信息表' VALUES ('194924', '202101', '60', '2021-01-07 00:00:00','10','郑州轻工业大学','二七广场','3','45','15');
-- ----------------------------
-- Table structure for 线路表
-- ----------------------------
DROP TABLE IF EXISTS '线路表';
CREATE TABLE '线路表' (
  '出发地'  varchar(20) NOT NULL,
  '目的地' varchar(20) NOT NULL,
  '汽车ID' varchar(20) NOT NULL,
  '发车时间' datetime NOT NULL,
  '所需时间' int NOT NULL,
  PRIMARY KEY(出发地, 目的地),
  FOREIGN KEY(汽车ID) REFERENCES 汽车信息(汽车ID)
);
-- ----------------------------
-- Records of 线路表
-- ----------------------------
INSERT INTO '线路表' VALUES ( '202101','2021-01-06 00:00:00','30','郑州轻工业大学','郑州大学');
INSERT INTO '线路表' VALUES ( '202102','2021-01-04 08:10:00','10','郑州大学','火车站');
INSERT INTO '线路表' VALUES ( '202103','2021-01-04 08:05:00','15','河南工业大学','二七广场');
INSERT INTO '线路表' VALUES ( '202104','2021-01-04 08:15:00','20','科学大道136号','郑州轻工业大学');
INSERT INTO '线路表' VALUES ( '202105','2021-01-04 08:20:00','40','郑州大学','郑州轻工业大学');
INSERT INTO '线路表' VALUES ( '202106','2021-01-04 08:30:00','10','须水河','二七广场');
INSERT INTO '线路表' VALUES ( '202107','2021-01-01 08:25:00','20','二七广场','河南大学');
INSERT INTO '线路表' VALUES ( '202108','2021-01-04 08:35:00','30','河南工业大学','火车站');
INSERT INTO '线路表' VALUES ( '202109','2021-01-04 09:00:00','50','河南大学','二七广场');
INSERT INTO '线路表' VALUES ( '202110','2021-01-04 09:10:00','60','郑州轻工业大学','火车站');
INSERT INTO '线路表' VALUES ( '202111','2021-01-04 07:30:00','40','二七广场','河南大学');
INSERT INTO '线路表' VALUES ( '202112','2021-01-04 09:30:00','30','科学大道136号','二七广场');
INSERT INTO '线路表' VALUES ( '202113','2021-01-04 09:20:00','20','二七广场','河南大学');
INSERT INTO '线路表' VALUES ( '202114','2021-01-04 09:10:00','30','郑州轻工业大学','河南大学');
INSERT INTO '线路表' VALUES ( '202115','2021-01-04 09:50:00','40','河南大学','郑州大学');
INSERT INTO '线路表' VALUES ( '202116','2021-01-04 09:01:00','50','郑州大学','郑州大学');
INSERT INTO '线路表' VALUES ( '202102','2021-01-06 00:00:00','30','河南工业大学','河南大学');
INSERT INTO '线路表' VALUES ( '202102','2021-01-06 00:00:00','30','河南大学','郑州大学');
INSERT INTO '线路表' VALUES ( '202101','2021-01-06 00:00:00','20','火车站','郑州轻工业大学');
INSERT INTO '线路表' VALUES ( '202101','2021-01-06 00:00:00','20','河南大学','二七广场');
INSERT INTO '线路表' VALUES ( '202105','2021-01-07 00:00:00','30','科学大道136号','郑州大学');
INSERT INTO '线路表' VALUES ( '202105','2021-01-07 00:00:00','60','河南大学','二七广场');
INSERT INTO '线路表' VALUES ( '202101','2021-01-07 00:00:00','10','郑州轻工业大学','二七广场');